
import Pkg
Pkg.add("JSON")
using JSON

name = JSON.parsefile("CityCountyData.json")
lol = JSON.json(name)

println(name[1])

str = "永和有永和路，中和也有永和路，
中和有中和路，永和也有中和路；
中和的中和路有接永和的中和路，
永和的永和路沒接中和的永和路；
永和的中和路有接永和的永和路，
中和的永和路沒接中和的中和路。

永和有中正路，中和也有中正路；
永和的中正路用景平路接中和的中正路。
永和有中山路，中和也有中山路；
永和的中山路直接接上了中和的中山路。
永和的中正路接上了永和的中山路；
中和的中正路卻不接中和的中山路。

中正橋下來不是中正路，但永和有中正路；
秀朗橋下來不是秀朗路，但永和有秀朗路。
永福橋下來不是永福路，永和沒有永福路；
福和橋下來不是福和路，但福和路接的卻是永福橋。

中和中和路永和永和路
永和中和路中和永和路
中和中山路永和中正路
永和中山路中和中正路"

d = Dict{String, Int64}()

for c ∈ str
    d[string(c)] = get(d, string(c), 0) + 1
end

d

new = JSON.json(d)


